[{"name": "Anima Anandkumar", "affiliation": "Caltech and NVIDIA", "contribution": "For significant contributions to machine learning including neural operators for scientific machine learning and tensor methods for probabilistic models.", "year": 2024}, {"name": "Claire Cardie", "affiliation": "Cornell University", "contribution": "For significant contributions to co-reference resolution, information and opinion extraction, and to machine learning methods in natural language processing.", "year": 2024}, {"name": "Nitesh Chawla", "affiliation": "University of Notre Dame", "contribution": "For significant advancements in learning from imbalanced data, learning on graphs, and interdisciplinary applications of AI.", "year": 2024}, {"name": "Cristina Conati", "affiliation": "University of British Columbia", "contribution": "For significant contributions to human-centered AI and AI-driven personalization, particularly for  intelligent tutoring systems and visualization.", "year": 2024}, {"name": "Jennifer Dy", "affiliation": "Northeastern University", "contribution": "For significant contributions to unsupervised and interpretable machine learning, advancing AI to address health care challenges, and service to the AI community.", "year": 2024}, {"name": "Ariel Felner", "affiliation": "Ben-Gurion University of the Negev", "contribution": "For significant contributions to the theory, practice and pedagogical aspects of heuristic search.", "year": 2024}, {"name": "Kristian Kersting", "affiliation": "TU Darmstadt", "contribution": "For significant contributions to the foundations and applications of statistical relational AI and neurosymbolic learning.", "year": 2024}, {"name": "Mausam ", "affiliation": "Indian Institute of Technology", "contribution": "For contributions to NLP, Planning & Human Computation; as well as his leadership in AI.", "year": 2024}, {"name": "Ariel Procaccia", "affiliation": "Harvard University", "contribution": "For contributions to AI and society, including foundational work on economic paradigms and practical impact on governance and group decisions.", "year": 2024}, {"name": "Brian Scassellati", "affiliation": "Yale University", "contribution": "For significant contributions to human-robot interaction and the use of robots to provide cognitive and social support.", "year": 2024}, {"name": "Kilian Weinberger", "affiliation": "Cornell University", "contribution": "For his contribution to machine learning and deep learning research.", "year": 2024}, {"name": "Jun Zhu", "affiliation": "Tsinghua University", "contribution": "For significant contributions to the theory and practice of machine learning. ", "year": 2024}, {"name": "Kristian Hammond", "affiliation": "Northwestern University", "contribution": " ", "year": 2023}, {"name": "Vipin Kumar", "affiliation": "University of Minnesota", "contribution": "For significant contributions to advancing AI and ML to address environmental problems.", "year": 2023}, {"name": "Xuelong Li", "affiliation": "Northwestern Polytechnical University", "contribution": " ", "year": 2023}, {"name": "Deborah McGuinness", "affiliation": "Rensselaer Polytechnic Institute", "contribution": " ", "year": 2023}, {"name": "Risto Miikkulainen", "affiliation": "University of Texas, Austin", "contribution": "For significant contribution to neuroevolution techniques and applications.", "year": 2023}, {"name": "Ana Paiva", "affiliation": "University of Lisbon", "contribution": " ", "year": 2023}, {"name": "Ronald Parr", "affiliation": "Duke University", "contribution": " ", "year": 2023}, {"name": "Matthias Scheutz", "affiliation": "Tufts University", "contribution": " ", "year": 2023}, {"name": "Csaba Szepesvàri", "affiliation": "University of Alberta", "contribution": "For significant contributions to adaptive control, reinforcement learning, and the theory of bandit problems.", "year": 2023}, {"name": "Jie Tang", "affiliation": "Tsinghua University", "contribution": "For significant contributions to information and social network mining.", "year": 2023}, {"name": "Kiri Wagstaff", "affiliation": "Jet Propulsion Laboratory", "contribution": "For significant contributions to deployed AI systems in NASA ground and spacecraft operations, AI education, and clustering algorithms.", "year": 2023}, {"name": "Innderjit Dhillon ", "affiliation": "University of Texas at Austin, US", "contribution": "For significant contributions to machine learning and large-scale data analysis.", "year": 2022}, {"name": "Pascale Fung ", "affiliation": "The Hong Kong University of Science & Technology, Hong Kong", "contribution": "For significant contributions to the field of conversational AI and to the development of ethical AI principles and algorithms.", "year": 2022}, {"name": "Kristina Lerman ", "affiliation": "University of Southern California, US", "contribution": "For significant contributions to the field of network science and the application of AI to computational social science.", "year": 2022}, {"name": "Barry O’Sullivan ", "affiliation": "School of Computer Science & IT, University College Cork, Ireland", "contribution": "For significant contributions to constraint programming and outstanding leadership in the AI community.", "year": 2022}, {"name": "Lynne E. Parker ", "affiliation": "University of Tennessee, US", "contribution": "For pioneering research in distributed robotics and exceptional leadership in AI policy.", "year": 2022}, {"name": "Cynthia Rudin ", "affiliation": "Duke University, US", "contribution": "For groundbreaking and pioneering work on interpretable machine learning and trustworthy AI.", "year": 2022}, {"name": "David Silver ", "affiliation": "DeepMind, UK", "contribution": "For significant contributions to machine learning and game theory, and the application of deep learning to game playing.", "year": 2022}, {"name": "Mary-Anne Williams ", "affiliation": "University of New South Wales and Stanford University", "contribution": "For significant contributions to knowledge representation and human-robot interaction and for leadership in the community.", "year": 2022}, {"name": "Peter Wurman ", "affiliation": "Sony Corporation, US", "contribution": "For significant contributions to computational auction theory and multi-agent systems, and for important applications of robotics.", "year": 2022}, {"name": "Shuicheng Yan ", "affiliation": "Sea Ltd., Singapore", "contribution": "For significant contributions to deep learning architectures and computer vision.", "year": 2022}, {"name": "Michael Bowling, ", "affiliation": "University of Alberta and DeepMind, Canada", "contribution": "For significant contributions to game-playing theory and practice and to machine learning.", "year": 2021}, {"name": "Ashok Goel, ", "affiliation": "Georgia Institute of Technology, USA", "contribution": "For significant contributions to research on cognitive systems, design, and education, and for distinguished leadership and teaching.", "year": 2021}, {"name": "Malte Helmert, ", "affiliation": "University of Basel, Switzerland", "contribution": "For significant contributions to the theory and practice of automated planning and combinatorial search.", "year": 2021}, {"name": "Jörg Hoffmann, ", "affiliation": "Saarland University, Germany", "contribution": "For significant contributions to AI planning and related areas, particularly in the design and analysis of heuristic functions and other search methods.", "year": 2021}, {"name": "Ayanna Howard, ", "affiliation": "The Ohio State University, USA", "contribution": "For significant contributions to human-robot interaction and for improving access and equity through artificial intelligence technologies.", "year": 2021}, {"name": "Odest Chadwicke Jenkins, ", "affiliation": "University of Michigan, USA", "contribution": "For significant contributions to the field of human-robot interaction and extensive service in broadening participation in artificial intelligence.", "year": 2021}, {"name": "Hiroaki Kitano, ", "affiliation": "Sony Corporation, Sony Computer Science Laboratories, Inc., Sony AI Inc. and Okinawa Institute of Science and Technology Graduate School, Japan", "contribution": "For significant contributions and leadership in robotics, massively parallel AI, and the use of AI for scientific discovery and systems biology.", "year": 2021}, {"name": "Rada Mihalcea, ", "affiliation": "University of Michigan, USA", "contribution": "For significant contributions to natural language processing and computational social science.", "year": 2021}, {"name": "Antonio Torralba, ", "affiliation": "Massachusetts Institute of Technology, USA", "contribution": "For significant contributions to scene recognition, large-scale visual datasets, and transfer learning.", "year": 2021}, {"name": "Holly Yanco, ", "affiliation": "University of Massachusetts Lowell, USA", "contribution": "For foundational contributions to the field of human-robot interaction and for exceptional leadership in education and broadening participation.", "year": 2021}, {"name": "Yoshua Bengio, ", "affiliation": "Université de Montréal, Canada", "contribution": "For foundational contributions to development of deep neural networks, scientific leadership in Canada, and service to the AI community.", "year": 2020}, {"name": "Cynthia Breazeal, ", "affiliation": "MIT Media Lab, USA", "contribution": "For foundational contributions to the field of socially interactive robots.", "year": 2020}, {"name": "William T. Freeman, ", "affiliation": "Massachusetts Institute of Technology and Google Research, USA", "contribution": "For significant contributions to computer vision and machine learning, especially the development of steerable filters, belief propagation, and motion re-rendering.", "year": 2020}, {"name": "Yann LeCun, ", "affiliation": "New York University, USA", "contribution": "For significant contributions to deep learning, neural networks, and image recognition, including the introduction of convolutional neural networks.", "year": 2020}, {"name": "Radhika Nagpal, ", "affiliation": "Harvard University, USA", "contribution": "For significant contributions to collective intelligence, especially self-organizing systems, including novel robotics and foundational theory.", "year": 2020}, {"name": "Natasha Noy, ", "affiliation": "Google, USA", "contribution": "For significant contributions to semantic web and ontology-development research, and for distinguished service to the community.", "year": 2020}, {"name": "Martha Palmer, ", "affiliation": "University of Colorado Boulder, USA", "contribution": "For significant contributions to natural language processing and knowledge representation, including widely-used corpora of annotated structures in several languages.", "year": 2020}, {"name": "Dragomir Radev, ", "affiliation": "Yale University, USA", "contribution": "For significant contributions to natural language processing and computational linguistics, and development of widely used techniques in text summarization, question answering, and education.", "year": 2020}, {"name": "Thomas Schiex, ", "affiliation": "Institut National de Recherche pour l’Agriculture, l’Alimentation et l’Environnement, France", "contribution": "For significant contributions to the theory and algorithms of constraint-based reasoning and to their applications in computational biology.", "year": 2020}, {"name": "Sylvie Thiébaux, ", "affiliation": "The Australian National University, Australia", "contribution": "For significant contributions to algorithms and applications of planning and scheduling, and service to the AI community.", "year": 2020}, {"name": "Vincent Conitzer, ", "affiliation": "Duke University, USA", "contribution": "For significant contributions to the advancement of artificial intelligence through integration with economics and philosophy, including game theory, mechanism design, social choice, and ethics.", "year": 2019}, {"name": "Luc De Raedt, ", "affiliation": "Katholieke Universiteit Leuven, Belgium", "contribution": "For significant contributions to learning and reasoning through the integration of logical and relational representations in machine learning and probabilistic models.", "year": 2019}, {"name": "Kristen Grauman, ", "affiliation": "University of Texas at Austin and Facebook AI Research, USA", "contribution": "For significant contributions to computer vision in visual recognition and search.", "year": 2019}, {"name": "Charles Isbell, ", "affiliation": "Georgia Institute of Technology, USA", "contribution": "For significant contributions to the field of interactive machine learning, computing education, and for increasing access and diversity in computing.", "year": 2019}, {"name": "Huan Liu, ", "affiliation": "Arizona State University, USA", "contribution": "For significant contributions to feature selection and social computing.", "year": 2019}, {"name": "Jiebo Luo, ", "affiliation": "University of Rochester, USA", "contribution": "For significant contributions to the fields of computer vision and data mining, and particularly pioneering work on multimodal understanding for sentiment analysis, computational social science, and digital health.", "year": 2019}, {"name": "Peter Stuckey, ", "affiliation": "Monash University, Australia", "contribution": "For significant contributions to logic programming and constraint programming.", "year": 2019}, {"name": "Nancy M. Amato, ", "affiliation": "Texas A&M University, USA", "contribution": "For significant contributions to the algorithmic foundations of motion planning in robotics and computational biology and leadership in broadening participation in computing.", "year": 2018}, {"name": "Regina Barzilay, ", "affiliation": "Massachusetts Institute of Technology, USA", "contribution": "For significant contributions to Natural Language Processing.", "year": 2018}, {"name": "Marie desJardins, ", "affiliation": "University of Maryland, Baltimore County, USA", "contribution": "For significant contributions to machine learning, planning, and multiagent systems, and for exceptional service, mentoring, and teaching.", "year": 2018}, {"name": "Kevin Leyton-Brown, ", "affiliation": "University of British Columbia, Canada", "contribution": "For significant contributions to machine learning for algorithm optimization, and theoretical and practical aspects of computational game theory and market design.", "year": 2018}, {"name": "Dinesh Manocha, ", "affiliation": "University of Maryland at College Park, USA", "contribution": "For significant contributions to robotics and multi-agent simulation.", "year": 2018}, {"name": "Joelle Pineau, ", "affiliation": "McGill University, Canada", "contribution": "For significant contributions to reinforcement learning, including planning and learning in complex partially-observable domains, and applications in robotics and healthcare.", "year": 2018}, {"name": "Amit Sheth, ", "affiliation": "Kno.e.sis, Wright State University, USA", "contribution": "For significant and enduring contribution to semantics and knowledge based techniques to transform diverse data into insights and actions.", "year": 2018}, {"name": "Gaurav S. Sukhatme, ", "affiliation": "University of Southern California, USA", "contribution": "For significant contributions in developing novel techniques for designing and understanding large-scale, distributed, networked robotic systems.", "year": 2018}, {"name": "Ronen I. Brafman, ", "affiliation": "Ben-Gurion University, Israel", "contribution": "For significant contributions to algorithms, representation, and theoretical foundations of automated decision making in the areas of preference handling, planning under uncertainty, multi-agent planning, and privacy.", "year": 2017}, {"name": "Eduard H. Hovy, ", "affiliation": "Carnegie Mellon University, USA", "contribution": "For significant contributions to natural language processing, including text summarization, semantic analysis, entity/event coreference and sentiment analysis.", "year": 2017}, {"name": "Tommi S. Jaakkola, ", "affiliation": "Massachusetts Institute of Technology, USA", "contribution": "For significant contributions to the fields of machine learning, computational biology and natural language processing.", "year": 2017}, {"name": "Maurizio Lenzerini, ", "affiliation": "Università degli Studi di Roma “La Sapienza,” Italy", "contribution": "For fundamental contributions to knowledge representation, description logics, ontologies, and AI and databases, which have become mainstream in AI.", "year": 2017}, {"name": "Fangzhen Lin, ", "affiliation": "Hong Kong University of Science and Technology, Hong Kong", "contribution": "For significant contributions to formal theories of knowledge representation, in particular nonmonotonic logics, answer-set programing, and theories of action.", "year": 2017}, {"name": "Dale Eric Schuurmans, ", "affiliation": "University of Alberta, Canada", "contribution": "For significant contributions to machine learning, including foundational methods for model selection, on-line learning, unsupervised learning and sequential decision making.", "year": 2017}, {"name": "Munindar P. Singh, ", "affiliation": "North Carolina State University, USA", "contribution": "For significant contributions to multiagent systems, especially via seminal formalizations of the interactions, communications, trust, and commitments among intelligent agents and services.", "year": 2017}, {"name": "Giuseppe De Giacomo, ", "affiliation": "University of Rome La Sapienza", "contribution": "For significant contributions to the field of knowledge representation and reasoning, and applications to data integration, ontologies, planning, and process synthesis and verification.", "year": 2016}, {"name": "Daniel D. Lee, ", "affiliation": "University of Pennsylvania", "contribution": "For significant contributions to machine learning and robotics, including algorithms for perception, planning, and motor control.", "year": 2016}, {"name": "Bing Liu, ", "affiliation": "University of Illinois at Chicago (UIC)", "contribution": "For significant contributions to data mining and development of widely used sentiment analysis, opinion spam detection, and Web mining algorithms.", "year": 2016}, {"name": "Maja J. Matarić ", "affiliation": "University of Southern California", "contribution": "For significant contributions to the advancement of multi-robot coordination, learning in human-robot systems, and socially assistive robotics.", "year": 2016}, {"name": "Eric Poe Xing, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to statistical machine learning, its theoretical analysis, new algorithms for learning probabilistic models, and applications of these to important problems in biology, social network analysis, natural language processing and beyond; and to the development of new architecture, system platform, and theory for distributed machine learning programs on large scale applications.", "year": 2016}, {"name": "Zhi-Hua Zhou, ", "affiliation": "Nanjing University", "contribution": "For significant contributions to ensemble methods and learning from multi-labeled and partially-labeled data.", "year": 2016}, {"name": "Rama Chellappa, ", "affiliation": "University of Maryland", "contribution": "For significant contributions to Markov random fields, 3D recovery from single and mutiple images and image/video-based recognition", "year": 2015}, {"name": "Marco Dorigo, ", "affiliation": "Université Libre de Bruxelles", "contribution": "For seminal contributions to the foundations of swarm intelligence, including ant colony optimization and swarm robotics", "year": 2015}, {"name": "Holger H. Hoos, ", "affiliation": "University of British Columbia", "contribution": "For significant contributions to the field of automated reasoning and the development of widely used methods for algorithm selection and configuration", "year": 2015}, {"name": "Adele E. Howe, ", "affiliation": "(deceased)", "contribution": "For significant contributions to the theory, practice and evaluation of automated planning, scheduling and other AI technologies, as well as service to the AI community", "year": 2015}, {"name": "Thorsten Joachims, ", "affiliation": "Cornell University", "contribution": "For significant contributions to the theory and practice of machine learning and information retrieval", "year": 2015}, {"name": "Carla E. Brodley, ", "affiliation": "Northeastern University", "contribution": "For significant contributions to machine learning and its application to science, engineering and medicine, and to increasing the participation of underrepresented groups in computer science.", "year": 2014}, {"name": "Jonathan Gratch, ", "affiliation": "USC Institute for Creative Technologies", "contribution": "For significant contributions to the fields of affective computing, virtual human research and autonomous systems.", "year": 2014}, {"name": "Michael N. Huhns, ", "affiliation": "University of South Carolina", "contribution": "For significant contributions to the field of multiagent systems and its applications in information management and service-oriented computing.", "year": 2014}, {"name": "Kevin Knight, ", "affiliation": "Information Sciences Institute, University of Southern California", "contribution": "For significant contributions to statistical machine translation, automata for natural language processing, and decipherment of historical manuscripts.", "year": 2014}, {"name": "James C. Lester, ", "affiliation": "North Carolina State University", "contribution": "For significant and sustained contributions to artificial intelligence technologies for education.", "year": 2014}, {"name": "Chih-Jen Lin, ", "affiliation": "National Taiwan University", "contribution": "For significant contributions to the field of machine learning, and the development of a widely used SVM software.", "year": 2014}, {"name": "Sridhar Mahadevan, ", "affiliation": "University of Massachusetts Amherst", "contribution": "For significant contributions to the field of machine learning including pioneering work in robot learning and representation discovery.", "year": 2014}, {"name": "Mark Maybury, ", "affiliation": "MITRE Corporation", "contribution": "For advancing natural language text generation and summarization, intelligent multimedia systems, intelligent user interfaces and knowledge management.", "year": 2014}, {"name": "David C. Parkes, ", "affiliation": "Harvard University", "contribution": "For significant contributions to multi-agent systems research through advances in auctions and mechanism design and development of the CS-economics research community.", "year": 2014}, {"name": "Bonnie Dorr, ", "affiliation": "“Institute for Human and Machine Cognition, Emerita at University of Maryland", "contribution": "For significant contributions to natural language understanding and representation, and development of the widely recognized methods for interlingual machine translation.", "year": 2013}, {"name": "Tim Finin, ", "affiliation": "University of Maryland, Baltimore County", "contribution": "For significant contributions to the theory and practice of knowledge sharing in multiagent systems and on the Web, and for sustained service to the AI community.", "year": 2013}, {"name": "Lise Getoor, ", "affiliation": "University of Maryland", "contribution": "For significant contributions to methods which combine probabilistic and logical representations in machine learning, knowledge discovery, graph mining, network analysis, and database systems.", "year": 2013}, {"name": "Sven Koenig, ", "affiliation": "University of Southern California", "contribution": "For significant contributions to planning, decision making and coordination for robots and other situated agents.", "year": 2013}, {"name": "Lillian Lee, ", "affiliation": "Cornell University", "contribution": "For significant contributions to natural language processing, including in sentiment analysis and in drawing connections to the social sciences.", "year": 2013}, {"name": "Gerald J. Tesauro, ", "affiliation": "IBM TJ Watson Research Center", "contribution": "For significant contributions to neural computation, game-playing (Backgammon, Chess and Jeopardy!), autonomic computing, and economic agents.", "year": 2013}, {"name": "Miroslaw Truszczynski, ", "affiliation": "University of Kentucky", "contribution": "For significant contributions to the theory of nonmonotonic reasoning and to the invention of answer set programming.", "year": 2013}, {"name": "Qiang Yang, ", "affiliation": "Hong Kong University of Science and Technology", "contribution": "For significant contributions to fundamental research and practical applications of AI planning, data mining and case-based reasoning", "year": 2013}, {"name": "Murray S. Campbell, ", "affiliation": "IBM T.J. Watson Research Center", "contribution": "For significant contributions to computer game-playing, especially chess, and the associated improvement in public awareness of the AI endeavor.", "year": 2012}, {"name": "Boi V. Faltings, ", "affiliation": "Swiss Federal Institute of Technology (EPFL)", "contribution": "For significant contributions to research and applications of spatial reasoning, distributed constraint reasoning, case-based reasoning, design, optimized communication, and social networking.", "year": 2012}, {"name": "Yolanda Gil, ", "affiliation": "USC/Information Sciences Institute", "contribution": "For significant contributions to intelligent user interfaces, knowledge capture, representations for web-based science, and for leadership in the AI community.", "year": 2012}, {"name": "Peter F. Patel-Schneider", "affiliation": "", "contribution": "For significant contributions to knowledge representation and reasoning, in particular the exploration of decidable logic fragments, reasoning optimizations, and the application of KR on the web.", "year": 2012}, {"name": "Francesca Rossi, ", "affiliation": "Università degli Studi di Padova", "contribution": "For significant contributions to constraint and preference reasoning, and for distinguished leadership and service.", "year": 2012}, {"name": "Peter H. Stone, ", "affiliation": "The University of Texas at Austin", "contribution": "For significant contributions to machine learning, multiagent systems, and robotics, and pioneering applications in the robot soccer, trading agents, and autonomous driving domains.", "year": 2012}, {"name": "Dieter Fox, ", "affiliation": "University of Washington", "contribution": "For significant contributions to probabilistic state estimation and its application to the fields of robotics and ubiquitous computing.", "year": 2011}, {"name": "Robert C. Holte, ", "affiliation": "University of Alberta", "contribution": "For significant contributions to the science and practice of empirical machine learning, and for leadership of the ", "year": 2011}, {"name": "Sheila A. McIlraith, ", "affiliation": "University of Toronto", "contribution": "For significant contributions to knowledge representation, reasoning about action, and the formal foundations of the semantic web and diagnostic problem solving.", "year": 2011}, {"name": "Satinder Singh Baveja, ", "affiliation": "University of Michigan", "contribution": "For significant contributions to reinforcement learning, including seminal theoretical results on algorithm properties and the foundations of dynamical system representations.", "year": 2011}, {"name": "Makoto Yokoo, ", "affiliation": "Kyushu University", "contribution": "For significant contributions to the theory and algorithms for multiagent systems and in particular in pioneering research in distributed constraint reasoning and mechanism design in anonymous environments.", "year": 2011}, {"name": "Shlomo Zilberstein, ", "affiliation": "University of Massachusetts Amherst", "contribution": "For significant contributions to decision-theoretic reasoning, resource-bounded reasoning, automated planning, decentralized decision making and multiagent systems.", "year": 2011}, {"name": "Pedro Domingos, ", "affiliation": "University of Washington", "contribution": "For significant contributions to the field of machine learning and to the unification of first-order logic and probability.", "year": 2010}, {"name": "Nicholas R. Jennings, ", "affiliation": "University of Southampton", "contribution": "For significant contributions to the theory and practice of multi-agent systems, including industrial applications, practical coordination techniques, and market-based control mechanisms.", "year": 2010}, {"name": "Michael L. Littman, ", "affiliation": "Rutgers University", "contribution": "For significant contributions to the fields of reinforcement learning, decision making under uncertainty, and statistical language applications.", "year": 2010}, {"name": "Christopher D. Manning, S", "affiliation": "tanford University", "contribution": "For significant contributions to statistical natural language processing, including in statistical parsing and grammar induction, and education through leading textbooks.", "year": 2010}, {"name": "Bernhard Nebel, ", "affiliation": "Albert-Ludwigs-Universitaet Freiburg", "contribution": "For significant contributions to knowledge representation and reasoning, planning, robotics, and services to the international AI community.", "year": 2010}, {"name": "Yoram Singer, ", "affiliation": "Google", "contribution": "For significant contributions to the theory and practice of efficient machine learning algorithms.", "year": 2010}, {"name": "Padhraic Smyth, ", "affiliation": "University of California, Irvine", "contribution": "For significant contributions to the theory and practice of statistical machine learning.", "year": 2010}, {"name": "Moshe Tennenholtz, ", "affiliation": "Technion – Israel Institute of Technology", "contribution": "For significant contributions in the area of multiagent systems and beyond, and for extraordinary service to the AI community.", "year": 2010}, {"name": "Wolfram Burgard, ", "affiliation": "Albert-Ludwigs-Universität Freiburg", "contribution": "For significant contributions to mobile robot navigation and environment modeling.", "year": 2009}, {"name": "William W. Cohen, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to many aspects of the theory and practice of machine learning.", "year": 2009}, {"name": "Andrew K. McCallum, ", "affiliation": "University of Massachusetts, Amherst", "contribution": "For significant contributions to the theory and application of information extraction, natural language processing, data mining, machine learning, and their integration.", "year": 2009}, {"name": "Jeffrey S. Rosenschein, ", "affiliation": "The Hebrew University of Jerusalem", "contribution": "For significant contributions to multiagent systems, automated negotiation, voting mechanisms, and to bringing game-theoretic mechanism design into computer science.", "year": 2009}, {"name": "Dan Roth, ", "affiliation": "University of Illinois at Urbana/Champaign", "contribution": "For significant contributions to the foundations of machine learning and inference and to developing learning-centered solutions to natural language problems.", "year": 2009}, {"name": "Daniela Rus, ", "affiliation": "MIT Computer Science and Artificial Intelligence Laboratory (CSAIL)", "contribution": "For significant contributions to the theory and practice of distributed robotics, agents, and sensor networks.", "year": 2009}, {"name": "Robert E. Schapire, ", "affiliation": "Princeton University", "contribution": "For significant contributions to machine learning, including the theory and practice of boosting.", "year": 2009}, {"name": "Venkatramanan Siva Subrahmanian, ", "affiliation": "University of Maryland, College Park", "contribution": "For significant contributions to the study of probabilistic databases, logic programming and agent-based systems.", "year": 2009}, {"name": "Pascal R. Van Hentenryck, ", "affiliation": "Brown University", "contribution": "For significant contributions to constraint satisfaction and reasoning under uncertainty, the development of the widely used CHIP, Numerica, OPL, and Comet systems, and his pioneering role in the inception of constraint programming and its integration in operations research.", "year": 2009}, {"name": "Yoav S. Freund, ", "affiliation": "University of California, San Diego", "contribution": "For significant contributions to machine learning including the development of practical boosting algorithms.", "year": 2008}, {"name": "Maria L. Gini, ", "affiliation": "University of Minnesota", "contribution": "For significant contributions to coordination and competition in multirobot and multiagent systems, for leadership in the AI community, and for inspiring the next generation.", "year": 2008}, {"name": "Lydia E. Kavraki, ", "affiliation": "Rice University", "contribution": "For significant contributions to the field of automated motion planning and the development of widely used probabilistic search algorithms", "year": 2008}, {"name": "Tuomas W. Sandholm, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to the foundations of multiagent systems and computational game theory, pioneering work in combinatorial auctions, multiagent preference elicitation, and automated mechanism design, and principles and large-scale application of electronic marketplaces.", "year": 2008}, {"name": "Peter van Beek, ", "affiliation": "University of Waterloo", "contribution": "For contributions to temporal reasoning, backtracking search algorithms, and constraint programming.", "year": 2008}, {"name": "Toby Walsh, ", "affiliation": "University of New South Wales", "contribution": "For significant and sustained contributions to automated deduction and constraint programming, and for extraordinary service to the AI community.", "year": 2008}, {"name": "Brian C. Williams, ", "affiliation": "Massachusetts Institute of Technology", "contribution": "For significant contributions to model-based reasoning and autonomous systems, and the innovative application of AI to space exploration.", "year": 2008}, {"name": "Michael John Wooldridge, ", "affiliation": "University of Liverpool", "contribution": "For significant contributions to logical foundations and complexity analysis of multiagent systems, including formal theories of teamwork and agent-oriented software engineering.", "year": 2008}, {"name": "Pierre F. Baldi, ", "affiliation": "University of California, Irvine", "contribution": "For significant contributions to statistical machine learning and the development of widely used algorithms/architectures to solve problems in the life sciences.", "year": 2007}, {"name": "Adnan Y. Darwiche, ", "affiliation": "University of California, Los Angeles", "contribution": "For significant contributions to the development and application of both probabilistic and logical methods in automated reasoning.", "year": 2007}, {"name": "Hector A Geffner", "affiliation": "ICREA and Universitat Pompeu Fabra", "contribution": "For significant contributions to the fields of planning, reasoning, and knowledge representation.", "year": 2007}, {"name": "Carla P. Gomes, ", "affiliation": "Cornell University", "contribution": "For significant contributions to constraint reasoning and the integration of techniques from artificial intelligence, constraint programming, and operations research.", "year": 2007}, {"name": "Russell Greiner, ", "affiliation": "University of Alberta", "contribution": "For significant contributions to the theory of statistical machine learning and its applications in bioinformatics and medical informatics.", "year": 2007}, {"name": "Stephen F. Smith, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to heuristic and mixed-initiative scheduling, constraint-based search, and the development of scalable AI systems.", "year": 2007}, {"name": "Milind Tambe, ", "affiliation": "University of Southern California", "contribution": "For significant contributions to theory and software infrastructure for multiagent systems and pioneering applications in teamwork systems.", "year": 2007}, {"name": "Fahiem Bacchus, ", "affiliation": "University of Toronto", "contribution": "For significant contributions in knowledge representation, automated planning, utility modeling, and algorithms for SAT and constraint satisfaction.", "year": 2006}, {"name": "Craig Boutilier, ", "affiliation": "University of Toronto", "contribution": "For significant contributions to default reasoning, belief revision, and decision-theoretic foundations of AI.", "year": 2006}, {"name": "Anthony G. Cohn, ", "affiliation": "University of Leeds", "contribution": "For significant contributions to knowledge representation, qualitative spatial reasoning, cognitive vision, and service to the international AI community.", "year": 2006}, {"name": "Gregory F. Cooper, ", "affiliation": "University of Pittsburgh", "contribution": "For significant contributions to the theory and applications of Bayesian reasoning and causal modeling, and the promotion of artificial intelligence within medicine.", "year": 2006}, {"name": "Jude W. Shavlik, ", "affiliation": "University of Wisconsin", "contribution": "For significant contributions to machine learning, especially knowledge-intensive approaches, and the application of machine learning to problems in computational biology.", "year": 2006}, {"name": "Oliviero Stock, ", "affiliation": "ITC-IRST", "contribution": "For wide-ranging, significant contributions to research in computational linguistics and intelligent interfaces, serious work on computational humor, and dedicated service and leadership in support of the European AI community.", "year": 2006}, {"name": "Sebastian Thrun, ", "affiliation": "Stanford University", "contribution": "For significant contributions to the theory of probabilistic robot navigation and its successful real-world application.", "year": 2006}, {"name": "Usama M. Fayyad, ", "affiliation": "Yahoo, Inc.", "contribution": "For significant research contributions to machine learning, data mining and KDD, exceptional service in founding a new AI subfield/community, and for successfully fielding and commercializing AI and KDD technologies.", "year": 2005}, {"name": "Raymond J. Mooney, ", "affiliation": "University of Texas at Austin", "contribution": "For significant contributions to machine learning, particularly explanation-based learning, theory refinement, and learning for natural-language processing.", "year": 2005}, {"name": "Andrew W. Moore, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to machine learning, data mining, and statistical AI, and for major roles in transferring these technologies to industry and government.", "year": 2005}, {"name": "David E. Smith, ", "affiliation": "NASA Ames Research Center", "contribution": "For significant contributions to the field of automated planning, including influential techniques for contingent, conformant, and temporal planning.", "year": 2005}, {"name": "Subbarao Kambhampati, ", "affiliation": "Arizona State University", "contribution": "For significant contributions to a unified theory of planning, its relation to constraint satisfaction, and development of varied speedup methods and heuristics.", "year": 2004}, {"name": "Craig A. Knoblock, ", "affiliation": "University of Southern California", "contribution": "For significant contributions to planning and information integration and the application of AI methods to complex domains.", "year": 2004}, {"name": "Daphne Koller, ", "affiliation": "Stanford University", "contribution": "For significant contributions to the integration of logic and probability and development of methods for reasoning, learning, and decision making under uncertainty.", "year": 2004}, {"name": "Gérard G. Medioni, ", "affiliation": "University of Southern California", "contribution": "For significant contributions to computer vision, including algorithms for feature extraction, organization, and matching.", "year": 2004}, {"name": "Stuart M. Shieber, ", "affiliation": "Harvard University", "contribution": "For significant contributions to the foundations of computational linguistics, to graphical and spokenlanguage interfaces, and to open scientific publishing.", "year": 2004}, {"name": "Moshe Y. Vardi, ", "affiliation": "Rice University", "contribution": "For significant contributions to the development of automated-reasoning techniques and to the development of logic as a unifying foundational framework and a tool for modeling computational systems.", "year": 2004}, {"name": "Oren Etzioni, ", "affiliation": "University of Washington", "contribution": "For significant contributions to the fields of software agents, web-based technology, and intelligent user interfaces.", "year": 2003}, {"name": "Scott E. Fahlman, ", "affiliation": "Carnegie Mellon University and IBM Research", "contribution": "For significant contributions to knowledge representation, artificial neural networks, AI-oriented software tools, and massively parallel architectures for AI.", "year": 2003}, {"name": "Michael Kearns, ", "affiliation": "University of Pennsylvania", "contribution": "For significant contributions to computational learning theory, to reinforcement learning and stochastic planning, to dialogue agents, and to the theory of multi-agent systems.", "year": 2003}, {"name": "Pradeep Khosla, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to automated modeling, reconfiguration, and design of robotic and real-time software systems, and for encouraging the field through professional leadership.", "year": 2003}, {"name": "Michael Pazzani, ", "affiliation": "University of California, Irvine", "contribution": "For significant contributions to the development and understanding of machine learning algorithms and their relationship to human learning.", "year": 2003}, {"name": "Reid Simmons, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to mobile robot navigation, self-reliant autonomous systems, and the Task Control Architecture.", "year": 2003}, {"name": "Manuela Veloso, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to the development of planning and learning algorithms, and multiagent robot teams for uncertain dynamic environments.", "year": 2003}, {"name": "Kevin D. Ashley, ", "affiliation": "University of Pittsburgh", "contribution": "For significant contributions in computationally modeling case-based and analogical reasoning in law and practical ethics.", "year": 2002}, {"name": "Michael Gelfond, ", "affiliation": "Texas Tech University", "contribution": "For significant contributions to the development of stable model semantics, answer set semantics, and work in cognitive robotics, logic programming, and nonmonotonic reasoning.", "year": 2002}, {"name": "Eric Horvitz, ", "affiliation": "Microsoft Research", "contribution": "For significant contributions to principles and applications of probability and utility in computation, including reasoning and decision making under limited resources, human-computer interaction, and machine learning.", "year": 2002}, {"name": "Henry E. Kyburg, Jr., ", "affiliation": "University of Rochester and Institute for Human and Machine Cognition", "contribution": "For significant contributions to the study of probabilistic, statistical and nonmonotonic inference.", "year": 2002}, {"name": "Michael I. Jordan, ", "affiliation": "University of California, Berkeley", "contribution": "For significant contributions to reasoning under uncertainty, machine learning, and human motor control.", "year": 2002}, {"name": "Sarit Kraus, ", "affiliation": "Bar-Ilan University and University of Maryland", "contribution": "For significant contributions to modeling of negotiation, collaboration, and non-monotonic reasoning, including theoretical advances and applications in various computational domains.", "year": 2002}, {"name": "Stephen H. Muggleton, ", "affiliation": "Imperial College of Science, Technology and Medicine", "contribution": "For significant contributions to the theory and practice of inductive logic programming, especially applied to the discovery of new biomolecular theories from observational data.", "year": 2002}, {"name": "Katia P. Sycara, ", "affiliation": "Carnegie Mellon University", "contribution": "For significant contributions to case-based reasoning, autonomous agents, and multiagent systems.", "year": 2002}, {"name": "Edmund H. Durfee, ", "affiliation": "University of Michigan", "contribution": "For significant contributions to the field of multiagent systems, distributed computing and real-time intelligent control.", "year": 2001}, {"name": "David Heckerman, ", "affiliation": "Microsoft Research", "contribution": "For significant contributions to reasoning and learning under uncertainty.", "year": 2001}, {"name": "Peter Norvig, ", "affiliation": "Google, Inc.", "contribution": "For significant contributions to educational materials, natural language processing techniques, web-based technology, and research management and leadership.", "year": 2001}, {"name": "Reid G. Smith, ", "affiliation": "Schlumberger Limited", "contribution": "For significant contributions to the science and practice of knowledge management, and for his role as principal architect of the widely cited contract net methodology.", "year": 2001}, {"name": "Richard S. Sutton, ", "affiliation": "AT&T Research", "contribution": "For significant contributions to many topics in machine learning, including reinforcement learning, temporal difference techniques, and neural networks.", "year": 2001}, {"name": "Michael Wellman, ", "affiliation": "University of Michigan", "contribution": "For significant contributions to decision theory, qualitative probabilistic and utilitarian reasoning, planning, multiagent systems, computational economics, electronic commerce, and editing the ", "year": 2001}, {"name": "Kenneth Ford, ", "affiliation": "Institute for Human & Machine Cognition", "contribution": "For leadership in exploring and explaining foundational issues and in establishing large-scale AI research programs and institutions.", "year": 2000}, {"name": "W. Eric L. Grimson, ", "affiliation": "Massachusetts Institute of Technology", "contribution": "For significant contributions to the theory and application of computer vision, ranging from algorithms for binocular stereo, surface interpolation and object recognition to deployed systems for computer-assisted surgery.", "year": 2000}, {"name": "Leslie Pack Kaelbling, ", "affiliation": "Massachusetts Institute of Technology", "contribution": "For seminal contributions to situated agents, machine learning, planning and mobile robotics.", "year": 2000}, {"name": "David Poole, ", "affiliation": "University of British Columbia", "contribution": "For significant contributions to the fields of abductive inference and default and probabilistic reasoning with applications to diagnosis and decision-making.", "year": 2000}, {"name": "Jonathan Schaeffer, ", "affiliation": "University of Alberta", "contribution": "For significant contributions to search and game-playing, including the design and implementation of the checker-playing system Chinook, the first program to win a human world championship in any non-trivial game of skill.", "year": 2000}, {"name": "Bart Selman, ", "affiliation": "Cornell University", "contribution": "For significant contributions to the field of knowledge representation and reasoning, and the development of widely used randomized methods in reasoning, search, and planning.", "year": 2000}, {"name": "Harry G. Barrow, ", "affiliation": "Schlumberger Cambridge Research", "contribution": "For seminal contributions towards understanding the computational nature of vision in humans and machines.", "year": 1999}, {"name": "James A. Hendler, ", "affiliation": "University of Maryland and DARPA/ISO", "contribution": "For significant contributions to the field of planning, knowledge representation, and high-performance artificial intelligence.", "year": 1999}, {"name": "Daniel S. Weld, ", "affiliation": "University of Washington", "contribution": "For significant contributions to development of qualitative reasoning methods, software agent technology, and plan synthesis algorithms.", "year": 1999}, {"name": "George A. Bekey, ", "affiliation": "University of Southern California", "contribution": "For contributions to the theory and practice of intelligent robotics, with applications to health care, space technology and human service.", "year": 1998}, {"name": "Steven Minton, ", "affiliation": "USC/Information Sciences Institute", "contribution": "For contributions to machine learning, planning, and constraint satisfaction, and for service to the AI community.", "year": 1998}, {"name": "Yoav Shoham, ", "affiliation": "Stanford University", "contribution": "For fundamental contributions concerning logics of time, knowledge, and belief that have resulted in significant advances in reasoning about time and change.", "year": 1998}, {"name": "David E. Wilkins, ", "affiliation": "SRI International", "contribution": "For contributions to both the theory and application of planning, especially for efficient, flexible ways of representing and reasoning about actions.", "year": 1998}, {"name": "Henry A. Kautz, ", "affiliation": "University of Washington", "contribution": "For contributions to many areas of artificial intelligence, from plan recognition to knowledge representation to software agents.", "year": 1997}, {"name": "Pat Langley, ", "affiliation": "Daimler-Benz Research and Technology Center and Institute for the Study of Learning and Expertise", "contribution": "For his cognitive models of numerous data-driven scientific discoveries and his founding role in the emergence of machine learning.", "year": 1997}, {"name": "Robert M. MacGregor, ", "affiliation": "USC/Information Sciences Institute", "contribution": "For contributions to knowledge representation, and development of the loom knowledge representation system", "year": 1997}, {"name": "David Allen McAllester, ", "affiliation": "AT&T Laboratories-Research", "contribution": "For contributions to the fields of knowledge representation, reasoning, search and planning.", "year": 1997}, {"name": "Stuart Russell, ", "affiliation": "University of California at Berkeley", "contribution": "For contributions to machine learning, bounded rationality and planning under uncertainty.", "year": 1997}, {"name": "Piero P. Bonissone, ", "affiliation": "General Electric Corporation", "contribution": "For his pioneering development of uncertainty calculus and its application to fuzzy-logic based control systems.", "year": 1996}, {"name": "Dana S. Nau, ", "affiliation": "University of Maryland", "contribution": "For contributions to the fields of AI search algorithms, AI planning, and AI applications in design and manufacturing.", "year": 1996}, {"name": "Martha E. Pollack, ", "affiliation": "University of Pittsburgh", "contribution": "For contributions to planning with limited resources and innovative research in discourse analysis.", "year": 1996}, {"name": "Charles E. Thorpe, ", "affiliation": "Carnegie Mellon University", "contribution": "For contributions to outdoor autonomous robots, including development of the highly successful Navlab vehicles.", "year": 1996}, {"name": "Beverly P. Woolf, ", "affiliation": "University of Massachusetts", "contribution": "For contributions to the science, technology, and dissemination of multimedia, intelligent tutoring systems and authoring tools.", "year": 1996}, {"name": "Luigia Carlucci Aiello", "affiliation": "Universitá di Roma", "contribution": "For contributions to the field of meta-level control and reasoning, and promotion of AI in Italy and Europe.", "year": 1995}, {"name": "Eugene C. Freuder", "affiliation": "University of New Hampshire", "contribution": "For fundamental and sustained contributions to the field of constraint-based reasoning.", "year": 1995}, {"name": "Michael P. Georgeff", "affiliation": "Australian Artificial Intelligence Institute", "contribution": "For pioneering theory and applications of reactive planning technology and agent architectures.", "year": 1995}, {"name": "Matthew L. Ginsberg", "affiliation": "University of Oregon", "contribution": "For theoretical and practical advances in nonmonotonic reasoning, planning, and search.", "year": 1995}, {"name": "Kurt Konolige", "affiliation": "SRI International", "contribution": "For landmark contributions to nonmonotonic logic, reasoning about beliefs, and mobile robotics.", "year": 1995}, {"name": "John E. Laird", "affiliation": "University of Michigan", "contribution": "For contributions to machine learning, integrated architectures for intelligence, and unified theories of cognition.", "year": 1995}, {"name": "Douglas R. Smith", "affiliation": "Kestrel Institute", "contribution": "For the development of an effective theory of algorithm design and for creating major new algorithms.", "year": 1995}, {"name": "Alan W. Biermann", "affiliation": "Duke University", "contribution": "For contributions to the fields of automatic programming and automated natural language understanding, including dialog systems.", "year": 1994}, {"name": "Thomas O. Binford", "affiliation": "Stanford University", "contribution": "For his role as a founding father in the field of computer vision and model-based perception in robotics; and for his many contributions to the fields.", "year": 1994}, {"name": "Thomas L. Dean", "affiliation": "Brown University", "contribution": "For contributions to the fields of automated planning, temporal reasoning, and robotics.", "year": 1994}, {"name": "Rina Dechter", "affiliation": "University of California, Irvine", "contribution": "For contributions to automated problem solving, heuristic search and constraint processing.", "year": 1994}, {"name": "Daniel C. Dennett", "affiliation": "Tufts University", "contribution": "For contributions to foundational problems in artificial intelligence and the philosophy of mind.", "year": 1994}, {"name": "Thomas Glen Dietterich", "affiliation": "Oregon State University", "contribution": "For contributions to the science and practice of machine learning, methodology of machine learning research, and for service to the AI community.", "year": 1994}, {"name": "John S. Gero", "affiliation": "University of Sydney", "contribution": "For pioneering research on AI in architecture and engineering, and outstanding leadership in the AI in design research community.", "year": 1994}, {"name": "Julia B. Hirschberg", "affiliation": "ATandT Bell Laboratories", "contribution": "For foundational research in discourse and speech processing; and for pioneering development of algorithms for incorporating discourse-level intonational features into speech synthesis systems.", "year": 1994}, {"name": "Jim Howe", "affiliation": "University of Edinburgh", "contribution": "For contributions to the design of learning environments, AI technology transfer, and the promotion of AI research in the United Kingdom.", "year": 1994}, {"name": "Philip Klahr", "affiliation": "Inference Corporation", "contribution": "For applying AI technology to solve real business problems, and for service to the AI community.", "year": 1994}, {"name": "Richard E. Korf", "affiliation": "University of California, Los Angeles", "contribution": "For contributions to the development and analysis of heuristic search methods.", "year": 1994}, {"name": "Kathleen R. McKeown", "affiliation": "Columbia University", "contribution": "For contributions to natural language generation and integration of language and graphics.", "year": 1994}, {"name": "Jacques Pitrat", "affiliation": "P. and M. Curie University", "contribution": "For his roles as a pioneer of AI in France, outstanding teacher and student leader; and for his many valuable contributions involving metaknowledge.", "year": 1994}, {"name": "Zenon W. Pylyshyn", "affiliation": "Rutgers University", "contribution": "For sustained contributions to the foundations of artificial intelligence and cognitive science.", "year": 1994}, {"name": "Paul S. Rosenbloom", "affiliation": "University of Southern California", "contribution": "For contributions to unified theories of cognition, and to integrated architectures for intelligence; and for service to the AI community.", "year": 1994}, {"name": "Stuart C. Shapiro", "affiliation": "State University of New York at Buffalo", "contribution": "For contributions to theory and practice of knowledge representation and reasoning, and service to the AI community.", "year": 1994}, {"name": "Judith B. Bachant", "affiliation": "Digital Equipment Corporation", "contribution": "For superior engineering accomplishments in embedding expert configuration systems in Digital’s business processes.", "year": 1993}, {"name": "Robert Balzer", "affiliation": "University of Southern California Information Sciences Institute", "contribution": "For contributions to automatic programming and rule-based development environments through the development of Gist, FSD, and the transformation based Rederivation Lifecycle.", "year": 1993}, {"name": "Margaret A. Boden", "affiliation": "University of Sussex", "contribution": "For contributions to the philosophy of AI, links between AI and psychology, social implications of AI, and making AI accessible to non-specialists.", "year": 1993}, {"name": "Paul R. Cohen", "affiliation": "University of Massachusetts", "contribution": "For leadership in the development of experimental methodologies for AI research, important contributions to real-time planning, and uncertainty management in expert systems.", "year": 1993}, {"name": "Peter Friedland", "affiliation": "NASA Ames Research Center", "contribution": "For pioneering work in planning, KR languages, scientific discovery, AI applications to molecular biology; and for extraordinary leadership and service.", "year": 1993}, {"name": "Cordell C. Green", "affiliation": "Kestrel Institute", "contribution": "For the development of the foundation theory for logic programming, the deductive data base field, and many formal-inference-based AI systems; and for his seminal contributions to the field of program synthesis.", "year": 1993}, {"name": "Joseph Y. Halpern", "affiliation": "International Business Machines", "contribution": "For sustained excellence in theoretical research on the logics of and relationships among knowledge, common knowledge, belief and probability.", "year": 1993}, {"name": "David Haussler", "affiliation": "University of California, Santa Cruz", "contribution": "For scientific contributions to the theory and practice of machine learning.", "year": 1993}, {"name": "Ellen Hildreth", "affiliation": "Wellesley College", "contribution": "For contributions to artificial intelligence in the fields of motion vision and natural computation.", "year": 1993}, {"name": "Ramesh Jain", "affiliation": "University of California San Diego", "contribution": "For pioneering and sustained contributions to computer vision research and applications.", "year": 1993}, {"name": "Jean-Claude Latombe", "affiliation": "Stanford University", "contribution": "For contributions to robotics, particularly the theory and practice of robot motion planning.", "year": 1993}, {"name": "Donald W. Loveland", "affiliation": "Duke University", "contribution": "For outstanding contributions to the field of automated reasoning and development of the model elimination theorem-proving procedure.", "year": 1993}, {"name": "John Mylopoulos", "affiliation": "University of Toronto", "contribution": "For outstanding leadership in Canadian AI; foundational roles in the oldest AI society; and superior productivity in education and research.", "year": 1993}, {"name": "Ramesh Patil", "affiliation": "University of Southern California Information Sciences Institute", "contribution": "For seminal contributions in medical AI, diagnostic reasoning, and knowledge representation; and for service to AAAI.", "year": 1993}, {"name": "Christopher K. Riesbeck", "affiliation": "Northwestern University", "contribution": "For pioneering contributions to natural language analysis by computer, and for the development and codification of case-based reasoning.", "year": 1993}, {"name": "Lenhart K. Schubert", "affiliation": "University of Rochester", "contribution": "For fundamental contributions in natural language processing, especially in the formalization, representation, and practical implementation of non-first order concepts.", "year": 1993}, {"name": "John F. Sowa", "affiliation": "State University of New York at Binghamton", "contribution": "For his outstanding contributions on the theory of conceptual graphs for knowledge representation and reasoning, and for his leadership in inspiring and directing the world-wide efforts of other researchers and students in advancing this theory.", "year": 1993}, {"name": "Mark J. Steedman", "affiliation": "University of Pennsylvania", "contribution": "For contributions to the integration of syntax, semantics, and prosody in human language processing, using the framework of categorial grammars.", "year": 1993}, {"name": "Austin Tate", "affiliation": "University of Edinburgh", "contribution": "For contributions to the development and use of knowledge-based planning techniques and artificial intelligence technology transfer.", "year": 1993}, {"name": "Richmond H. Thomason", "affiliation": "University of Pittsburgh", "contribution": "For fundamental contributions to the logical foundations of artificial intelligence and computational linguistics.", "year": 1993}, {"name": "Wolfgang Wahlster", "affiliation": "German Research Center for AI (DFKI)", "contribution": "For pioneering work in the development of dialog systems, and outstanding service to the artificial intelligence community.", "year": 1993}, {"name": "Sholom M. Weiss", "affiliation": "Rutgers University", "contribution": "For pioneering contributions to practical systems for causal and expert reasoning, and machine learning, especially in biomedicine.", "year": 1993}, {"name": "William L. Whittaker", "affiliation": "Carnegie Mellon University", "contribution": "For contributions to robotics education, and research and development of field robotics.", "year": 1993}, {"name": "Narendra Ahuja", "affiliation": "University of Illinois", "contribution": "For significant contributions to the integration of multiple cues for three-dimensional and active vision; object representation and path planning; and multiprocessor architectures for computer vision.", "year": 1992}, {"name": "Michael Anthony Arbib", "affiliation": "University of Southern California", "contribution": "For his work in schema theory and neural networks to provide a linking methodology between distributed artificial intelligence and brain theory.", "year": 1992}, {"name": "William J. Clancey", "affiliation": "Institute for Human & Machine Cognition and NASA/Ames Research Center", "contribution": "For his influential knowledge analyses of expert systems and pioneering work in grounding AI research in scientific and engineering modeling.", "year": 1992}, {"name": "Philip R. Cohen", "affiliation": "SRI International", "contribution": "For seminal work in the plan-based application of speech acts, and continued excellence in the study of natural language discourse.", "year": 1992}, {"name": "Gerald Francis DeJong III", "affiliation": "University of Illinois", "contribution": "For seminal technical contributions to natural language processing and machine learning, as well as excellence in teaching future researchers.", "year": 1992}, {"name": "Lee D. Erman", "affiliation": "Cimflex Teknowledge Corporation", "contribution": "For contributions to the development and dissemination of AI Technology and service to AAAI.", "year": 1992}, {"name": "Kenneth D. Forbus", "affiliation": "Northwestern University", "contribution": "For contributions to qualitative physics, cognitive modeling, reasoning engine design and machine learning, and general service to the AI community.", "year": 1992}, {"name": "Frederick Hayes-Roth", "affiliation": "Cimflex Teknowledge Corporation", "contribution": "For leadership in commercialization of expert system technology; for the co-development of Hearsay II and opportunistic-planning; and for the technical management of ROSIE, M.1, S.1, and ABE.", "year": 1992}, {"name": "Jerry Robert Hobbs", "affiliation": "SRI International", "contribution": "For research in artificial intelligence, particularly natural language understanding and knowledge representation.", "year": 1992}, {"name": "Laveen N. Kanal", "affiliation": "University of Maryland and L. N. K. Corporation", "contribution": "For contributions to pattern recognition and heuristic search procedures and their application in the machine recognition of patterns.", "year": 1992}, {"name": "Janet L. Kolodner", "affiliation": "Georgia Institute of Technology", "contribution": "For pioneering research on case-based reasoning and learning, including memory organization, information retrieval, problem solving, and knowledge acquisition.", "year": 1992}, {"name": "Benjamin J. Kuipers", "affiliation": "University of Texas at Austin", "contribution": "For fundamental contributions to qualitative reasoning about physical systems (QSIM) and qualitative methods for robot exploration and cognitive mapping.", "year": 1992}, {"name": "Mitchell P. Marcus", "affiliation": "University of Pennsylvania", "contribution": "For work in novel parsing architectures for integrating syntax, semantics, and psycholinguistic phenomena, and the development of learning techniques based on large corpora.", "year": 1992}, {"name": "Matthew T. Mason", "affiliation": "Carnegie Mellon University", "contribution": "For lasting contributions to robotic manipulation in the areas of compliant force control, planning under uncertainty, the mechanics of pushing, and sensorless manipulation strategies.", "year": 1992}, {"name": "Ramakant Nevatia", "affiliation": "University of Southern California", "contribution": "For pioneering contributions to many aspects of computer vision, especially in computational descriptions of complex three-dimensional objects.", "year": 1992}, {"name": "Glenn R. Shafer", "affiliation": "Rutgers University", "contribution": "For the development of the Dempster-Shafer theory of evidence and its applications to AI systems.", "year": 1992}, {"name": "Howard E. Shrobe", "affiliation": "Massachusetts Institute of Technology", "contribution": "For significant contributions in the development of new problem solving approaches and programming languages, and for service to the field.", "year": 1992}, {"name": "William R. Swartout", "affiliation": "University of Southern California Information Sciences Institute", "contribution": "For seminal contributions in the areas of knowledge-based machine explanation, and for extraordinary service to the Artificial Intelligence community.", "year": 1992}, {"name": "Peter Szolovits", "affiliation": "Massachusetts Institute of Technology", "contribution": "For pioneering the application of Artificial Intelligence in Medicine.", "year": 1992}, {"name": "Leslie G. Valiant", "affiliation": "Harvard University", "contribution": "For the development of computational learning theory, and providing a scientific basis for research in machine learning.", "year": 1992}, {"name": "Robert S. Boyer", "affiliation": "University of Texas at Austin", "contribution": "", "year": 1991}, {"name": "Jaime Carbonell", "affiliation": "Carnegie Mellon University", "contribution": "", "year": 1991}, {"name": "B. Chandrasekaran", "affiliation": "The Ohio State University", "contribution": "", "year": 1991}, {"name": "Jon Doyle", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1991}, {"name": "Mark S. Fox", "affiliation": "University of Toronto", "contribution": "", "year": 1991}, {"name": "Barbara Hayes-Roth", "affiliation": "Stanford University", "contribution": "", "year": 1991}, {"name": "Elaine Kant", "affiliation": "Schlumberger Laboratory for Computer Science", "contribution": "", "year": 1991}, {"name": "Robert A. Kowalski", "affiliation": "Imperial College of Science and Technology", "contribution": "", "year": 1991}, {"name": "Wendy G. Lehnert", "affiliation": "University of Massachusetts", "contribution": "", "year": 1991}, {"name": "Vladimir Lifschitz", "affiliation": "University of Texas at Austin", "contribution": "", "year": 1991}, {"name": "J. Strother Moore", "affiliation": "Computer Logic Incorporated", "contribution": "", "year": 1991}, {"name": "Robert C. Moore", "affiliation": "SRI International", "contribution": "", "year": 1991}, {"name": "Fernando C. N. Pereira", "affiliation": "AT&T Bell Laboratories", "contribution": "", "year": 1991}, {"name": "Elaine Rich", "affiliation": "Microelectronics Computer Consortium", "contribution": "", "year": 1991}, {"name": "Edwina L. Rissland", "affiliation": "University of Massachusetts", "contribution": "", "year": 1991}, {"name": "Candace L. Sidner", "affiliation": "Lotus Development Corporation", "contribution": "", "year": 1991}, {"name": "Aaron Sloman", "affiliation": "The University of Birmingham", "contribution": "", "year": 1991}, {"name": "Richard J. Waldinger", "affiliation": "SRI International", "contribution": "", "year": 1991}, {"name": "Robert Wilensky", "affiliation": "University of California, Berkeley", "contribution": "", "year": 1991}, {"name": "Yorick A. Wilks", "affiliation": "“Institute for Human and Machine Cognition / New Mexico State University", "contribution": "", "year": 1991}, {"name": "Lotfi A. Zadeh", "affiliation": "University of California, Berkeley", "contribution": "", "year": 1991}, {"name": "James F. Allen", "affiliation": "University of Rochester and Institute for Human and Machine Cognition", "contribution": "", "year": 1990}, {"name": "Ruzena Bajcsy", "affiliation": "University of Pennsylvania", "contribution": "", "year": 1990}, {"name": "Hans Berliner", "affiliation": "Carnegie Mellon University", "contribution": "", "year": 1990}, {"name": "Wolfgang Bibel", "affiliation": "FG Intellektik", "contribution": "", "year": 1990}, {"name": "Ronald J. Brachman", "affiliation": "AT&T Bell Laboratories", "contribution": "", "year": 1990}, {"name": "J. Michael Brady", "affiliation": "Oxford University", "contribution": "", "year": 1990}, {"name": "Rodney A. Brooks", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "John Seely Brown", "affiliation": "Xerox Palo Alto Research Center", "contribution": "", "year": 1990}, {"name": "Bruce Buchanan", "affiliation": "University of Pittsburgh", "contribution": "", "year": 1990}, {"name": "Alan Bundy", "affiliation": "University of Edinburgh", "contribution": "", "year": 1990}, {"name": "Eugene Charniak", "affiliation": "Brown University", "contribution": "", "year": 1990}, {"name": "Allan Collins", "affiliation": "Bolt, Beranek and Newman", "contribution": "", "year": 1990}, {"name": "Randall Davis", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "Johan De Kleer", "affiliation": "Xerox Palo Alto Research Center", "contribution": "", "year": 1990}, {"name": "Richard Duda", "affiliation": "San Jose State University", "contribution": "", "year": 1990}, {"name": "Edward A. Feigenbaum", "affiliation": "Stanford University", "contribution": "", "year": 1990}, {"name": "Jerome Feldman", "affiliation": "International Computer Science Institute", "contribution": "", "year": 1990}, {"name": "Richard E. Fikes", "affiliation": "Stanford University", "contribution": "", "year": 1990}, {"name": "Michael Genesereth", "affiliation": "Stanford University", "contribution": "", "year": 1990}, {"name": "Barbara J. Grosz", "affiliation": "Harvard University", "contribution": "", "year": 1990}, {"name": "Peter Hart", "affiliation": "Ricoh Corporation", "contribution": "", "year": 1990}, {"name": "Patrick J. Hayes", "affiliation": "Institute for Human & Machine Cognition", "contribution": "", "year": 1990}, {"name": "Geoffrey E. Hinton", "affiliation": "University of Toronto", "contribution": "", "year": 1990}, {"name": "Berthold K. P. Horn", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "Aravind K. Joshi", "affiliation": "University of Pennsylvania", "contribution": "", "year": 1990}, {"name": "Robert E. Kahn", "affiliation": "Corporation for National Research Initiatives", "contribution": "", "year": 1990}, {"name": "Takeo Kanade", "affiliation": "Carnegie Mellon University", "contribution": "", "year": 1990}, {"name": "Casimir A. Kulikowski", "affiliation": "Rutgers University", "contribution": "", "year": 1990}, {"name": "Douglas B. Lenat", "affiliation": "Microelectronics Computer Consortium", "contribution": "", "year": 1990}, {"name": "Victor R. Lesser", "affiliation": "University of Massachusetts", "contribution": "", "year": 1990}, {"name": "Hector Levesque", "affiliation": "University of Toronto", "contribution": "", "year": 1990}, {"name": "Tomas Lozano-Perez", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "Alan K. Mackworth", "affiliation": "University of British Columbia", "contribution": "", "year": 1990}, {"name": "Drew McDermott", "affiliation": "Yale University", "contribution": "", "year": 1990}, {"name": "John McDermott", "affiliation": "Digital Equipment Corporation", "contribution": "", "year": 1990}, {"name": "Jack Minker", "affiliation": "University of Maryland", "contribution": "", "year": 1990}, {"name": "Tom Mitchell", "affiliation": "Carnegie Mellon University", "contribution": "", "year": 1990}, {"name": "Judea Pearl", "affiliation": "University of California, Los Angeles", "contribution": "", "year": 1990}, {"name": "C. Raymond Perrault", "affiliation": "SRI International", "contribution": "", "year": 1990}, {"name": "Tomaso Poggio", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "John Ross Quinlan", "affiliation": "University of Sydney", "contribution": "", "year": 1990}, {"name": "Marc Raibert", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "Raj Reddy", "affiliation": "Carnegie Mellon University", "contribution": "", "year": 1990}, {"name": "Alan Robinson", "affiliation": "Syracuse University", "contribution": "", "year": 1990}, {"name": "Stanley J. Rosenschein", "affiliation": "Teleos Research", "contribution": "", "year": 1990}, {"name": "Erik J. Sandewall", "affiliation": "University of Linkoeping", "contribution": "", "year": 1990}, {"name": "Roger Schank", "affiliation": "Northwestern University", "contribution": "", "year": 1990}, {"name": "Edward H. Shortliffe", "affiliation": "Stanford University", "contribution": "", "year": 1990}, {"name": "James R. Slagle", "affiliation": "University of Minnesota", "contribution": "", "year": 1990}, {"name": "Guy L. Steele, Jr.", "affiliation": "Thinking Machines Corporation", "contribution": "", "year": 1990}, {"name": "Mark J. Stefik", "affiliation": "Xerox Palo Alto Research Center", "contribution": "", "year": 1990}, {"name": "Gerald Jay Sussman", "affiliation": "Massachusetts Institute of Technology", "contribution": "", "year": 1990}, {"name": "Jay M. Tenenbaum", "affiliation": "Enterprise Integration Technologies Corporation", "contribution": "", "year": 1990}, {"name": "Bonnie Lynn Webber", "affiliation": "University of Pennsylvania", "contribution": "", "year": 1990}, {"name": "William Woods", "affiliation": "Sun Microsystems Laboratories", "contribution": "", "year": 1990}]